{
  "backend/main.mo": "Motoko actor defining Product and Order types with full CRUD operations stored in in-memory maps, including filtering by seller, category, and buyer email.",
  "feature_evidence.json": "Feature evidence report confirming the shop name was updated from 'Dondon's Core' to 'Dondon's little luxuries' across index.html, Layout.tsx, and ProductsPage.tsx.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a quick reference for the project's frontend structure.",
  "frontend/index.css": "Global Tailwind CSS base with OKLCH design tokens for light and dark modes covering background, foreground, primary, card, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point that sets the browser tab title to \"Dondon's little luxuries\" and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (shop, product detail, cart, checkout, order confirmation, seller dashboard) wrapped in CartProvider and Layout.",
  "frontend/src/components/Layout.tsx": "App shell component with a sticky header displaying the Dondon's little luxuries logo image, pill-shaped nav links, a cart badge button, mobile menu, and a branded footer.",
  "frontend/src/components/OrdersTable.tsx": "Responsive table component that displays orders with buyer info, line items, totals, and an inline status dropdown that triggers updateOrderStatus mutations.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, title, price, stock status, and an add-to-cart button, linking to the product detail page.",
  "frontend/src/components/ProductForm.tsx": "A form component for creating or editing a product, with validation for title, price, stock, and category fields.",
  "frontend/src/contexts/CartContext.tsx": "Provides a React context for cart state management, exposing actions to add, remove, update, and clear cart items along with computed totals.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via AuthClient, providing a React context and hook with login/logout functions and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations on products and orders, including fetching, creating, updating, and deleting.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines a baby-pink light/dark theme using CSS custom properties.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, price formatting, date formatting, and generating the current ISO timestamp.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item list, quantity controls, and remove buttons, plus an order summary with a checkout button. Shows an empty state with a browse link when the cart has no items.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders a checkout form collecting buyer name and email, validates inputs, submits an order via the createOrder mutation, then navigates to the order confirmation page on success.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a post-purchase confirmation screen displaying order ID, total paid, and status read from URL search params, with buttons to continue shopping or view the seller dashboard.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays a single product's image, category, description, price, and stock, with an Add to Cart button and loading/not-found states.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with a hero banner, search input, and category filter buttons, rendering filtered results as ProductCard components with skeleton loading states.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Provides a seller dashboard with stats (products, orders, revenue), a tabbed view of products and orders, and dialogs for adding, editing, and deleting products.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom fonts (Nunito, Pacifico), OKLCH-based color tokens, border radii, box shadows, and keyframe animations using typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 7) for 'Dondon's little luxuries' shopping app, including feature history, architectural notes, known issues, image requirements, and a baby-pink babydoll aesthetic theme description."
}